In [2]:
import pandas as pd

data=pd.read_csv('dataset.csv')

print(data)

   id    name  salary  start_date        dept
0   1    Rick  623.30  2012-01-01          IT
1   2     Dan  515.20  2013-09-23  Operations
2   3   Tusar  611.00  2014-11-15          IT
3   4    Ryan  729.00  2014-05-11          HR
4   5    Gary  843.25  2015-03-27     Finance
5   6   Rasmi  578.00  2013-05-21          IT
6   7  Pranab  632.80  2013-07-30  Operations
7   8    Guru  722.50  2014-06-17     Finance

In [3]:
data.head()

   id   name  salary  start_date        dept
0   1   Rick  623.30  2012-01-01          IT
1   2    Dan  515.20  2013-09-23  Operations
2   3  Tusar  611.00  2014-11-15          IT
3   4   Ryan  729.00  2014-05-11          HR
4   5   Gary  843.25  2015-03-27     Finance

In [4]:
data.tail()

   id    name  salary  start_date        dept
3   4    Ryan  729.00  2014-05-11          HR
4   5    Gary  843.25  2015-03-27     Finance
5   6   Rasmi  578.00  2013-05-21          IT
6   7  Pranab  632.80  2013-07-30  Operations
7   8    Guru  722.50  2014-06-17     Finance

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          8 non-null      int64
 1   name        8 non-null      object
 2   salary      8 non-null      float64
 3   start_date  8 non-null      object
 4   dept        8 non-null      object
dtypes: float64(1), int64(1), object(3)
memory usage: 288.0+ bytes

In [6]:
print(data)

   id    name  salary  start_date        dept
0   1    Rick  623.30  2012-01-01          IT
1   2     Dan  515.20  2013-09-23  Operations
2   3   Tusar  611.00  2014-11-15          IT
3   4    Ryan  729.00  2014-05-11          HR
4   5    Gary  843.25  2015-03-27     Finance
5   6   Rasmi  578.00  2013-05-21          IT
6   7  Pranab  632.80  2013-07-30  Operations
7   8    Guru  722.50  2014-06-17     Finance

In [8]:
import pandas as pd

data=pd.read_csv('dataset.csv')

print(data)

   id    name  salary  start_date        dept
0   1    Rick  623.30  01/01/2012          IT
1   2     NaN     NaN         NaN         NaN
2   3     Dan  515.20  23/09/2013  Operations
3   4   Tusar  611.00  15/11/2014          IT
4   5    Ryan  729.00  11/05/2014          HR
5   6     NaN     NaN         NaN         NaN
6   7    Gary  843.25  27/03/2015     Finance
7   8   Rasmi  578.00  21/05/2013          IT
8   9  Pranab  632.80  30/07/2013  Operations
9  10    Guru  722.50  17/06/2014     Finance

In [10]:
data.shape

(10, 5)

In [11]:
data.isnull()

      id   name  salary  start_date   dept
0  False  False   False       False  False
1  False   True    True        True   True
2  False  False   False       False  False
3  False  False   False       False  False
4  False  False   False       False  False
5  False   True    True        True   True
6  False  False   False       False  False
7  False  False   False       False  False
8  False  False   False       False  False
9  False  False   False       False  False

In [12]:
data.fillna(method='pad')

   id    name  salary  start_date        dept
0   1    Rick  623.30  01/01/2012          IT
1   2    Rick  623.30  01/01/2012          IT
2   3     Dan  515.20  23/09/2013  Operations
3   4   Tusar  611.00  15/11/2014          IT
4   5    Ryan  729.00  11/05/2014          HR
5   6    Ryan  729.00  11/05/2014          HR
6   7    Gary  843.25  27/03/2015     Finance
7   8   Rasmi  578.00  21/05/2013          IT
8   9  Pranab  632.80  30/07/2013  Operations
9  10    Guru  722.50  17/06/2014     Finance

In [14]:
import pandas as pd

data=pd.read_csv('dataset.csv')
print("before drop function")
print(data)

print("after drop function")
data=data.dropna()
print(data)

before drop function
   id    name  salary  start_date        dept
0   1    Rick  623.30  01/01/2012          IT
1   2     NaN     NaN         NaN         NaN
2   3     Dan  515.20  23/09/2013  Operations
3   4   Tusar  611.00  15/11/2014          IT
4   5    Ryan  729.00  11/05/2014          HR
5   6     NaN     NaN         NaN         NaN
6   7    Gary  843.25  27/03/2015     Finance
7   8   Rasmi  578.00  21/05/2013          IT
8   9  Pranab  632.80  30/07/2013  Operations
9  10    Guru  722.50  17/06/2014     Finance
after drop function
   id    name  salary  start_date        dept
0   1    Rick  623.30  01/01/2012          IT
2   3     Dan  515.20  23/09/2013  Operations
3   4   Tusar  611.00  15/11/2014          IT
4   5    Ryan  729.00  11/05/2014          HR
6   7    Gary  843.25  27/03/2015     Finance
7   8   Rasmi  578.00  21/05/2013          IT
8   9  Pranab  632.80  30/07/2013  Operations
9  10    Guru  722.50  17/06/2014     Finance

In [16]:
print(data.loc[1:5],['name'])

   id   name  salary  start_date        dept
2   3    Dan   515.2  23/09/2013  Operations
3   4  Tusar   611.0  15/11/2014          IT
4   5   Ryan   729.0  11/05/2014          HR ['name']